-----------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\opensafely-risk-factors-research-full\analysis\output/1daysooner.log
  log type:  text
 opened on:  19 Sep 2020, 10:03:59

. use cr_create_analysis_dataset_inc_children.dta, clear
(Analysis dataset for the poor outcomes in Covid project)

. 
. egen agecat = cut(age), at(0,10,20,30,40,50,60,70,120)

. recode cancer_exhaem_cat 1=0
(cancer_exhaem_cat: 20585602 changes made)

. recode cancer_haem_cat 1=0
(cancer_haem_cat: 21342436 changes made)

. recode reduced_kidney_function_cat 1=0
(reduced_kidney_function_cat: 20359120 changes made)

. 
. gen comorbidity = 0

. ***Comorbidities
. * To be added: dates related to outcomes
. foreach var of varlist  diabetes cancer_exhaem_cat cancer_haem_cat reduced_kidney_function_cat asthma chronic_respiratory_disease chronic_cardiac_disease htdia
> g_or_highbp chronic_liver_disease stroke_dementia other_neuro organ_transplant spleen ra_sle_psoriasis other_immunosuppression   {
  2.         replace comorbidity = 1 if `var' > 0
  3. }
(1,732,735 real changes made)
(691,077 real changes made)
(70,870 real changes made)
(628,688 real changes made)
(2,663,068 real changes made)
(279,847 real changes made)
(418,287 real changes made)
(2,892,567 real changes made)
(25,580 real changes made)
(37,783 real changes made)
(57,388 real changes made)
(1,039 real changes made)
(9,506 real changes made)
(316,825 real changes made)
(163,452 real changes made)

. 
. bysort male: tab agecat onscoviddeath

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
-> male = 0

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
    agecat |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,052,302          0 | 1,052,302 
        10 | 1,176,606          0 | 1,176,606 
        20 |  REDACTED        <=5 | 1,225,905 
        30 | 1,451,632         22 | 1,451,654 
        40 | 1,383,714         50 | 1,383,764 
        50 | 1,500,500        170 | 1,500,670 
        60 | 1,205,723        361 | 1,206,084 
        70 | 1,675,582      4,156 | 1,679,738 
-----------+----------------------+----------
     Total |  REDACTED   REDACTED |10,676,723 

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
-> male = 1

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
    agecat |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,108,656          0 | 1,108,656 
        10 | 1,251,888          0 | 1,251,888 
        20 | 1,304,879          8 | 1,304,887 
        30 | 1,508,938         19 | 1,508,957 
        40 | 1,466,130         90 | 1,466,220 
        50 | 1,550,088        352 | 1,550,440 
        60 | 1,185,568        740 | 1,186,308 
        70 | 1,385,831      4,953 | 1,390,784 
-----------+----------------------+----------
     Total |10,761,978      6,162 |10,768,140 


. 
. drop if comorbidity == 1
(9,988,712 observations deleted)

. bysort male: tab agecat onscoviddeath

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
-> male = 0

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
    agecat |         0          1 |     Total
-----------+----------------------+----------
         0 |   988,343          0 |   988,343 
        10 |   990,232          0 |   990,232 
        20 |   875,401          0 |   875,401 
        30 |   921,576          6 |   921,582 
        40 |  REDACTED        <=5 |   763,004 
        50 |   637,792         15 |   637,807 
        60 |   339,256         27 |   339,283 
        70 |   182,588        147 |   182,735 
-----------+----------------------+----------
     Total |  REDACTED   REDACTED | 5,698,387 

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
-> male = 1

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
    agecat |         0          1 |     Total
-----------+----------------------+----------
         0 | 1,019,654          0 | 1,019,654 
        10 | 1,010,529          0 | 1,010,529 
        20 |   913,500          6 |   913,506 
        30 |   987,639          6 |   987,645 
        40 |   802,912         20 |   802,932 
        50 |   605,880         41 |   605,921 
        60 |   283,009         65 |   283,074 
        70 |   134,332        171 |   134,503 
-----------+----------------------+----------
     Total | 5,757,455        309 | 5,757,764 


. 
. drop if bmicat > 2
(8,815,475 observations deleted)

. bysort male: tab agecat onscoviddeath

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
-> male = 0

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
    agecat |         0          1 |     Total
-----------+----------------------+----------
        10 |    90,338          0 |    90,338 
        20 |   408,985          0 |   408,985 
        30 |  REDACTED        <=5 |   413,558 
        40 |   303,617          0 |   303,617 
        50 |   238,349          6 |   238,355 
        60 |   135,328          9 |   135,337 
        70 |    78,484         90 |    78,574 
-----------+----------------------+----------
     Total |  REDACTED   REDACTED | 1,668,764 

-----------------------------------------------------------------------------------------------------------------------------------------------------------------
-> male = 1

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
    agecat |         0          1 |     Total
-----------+----------------------+----------
        10 |    29,771          0 |    29,771 
        20 |   250,091          0 |   250,091 
        30 |  REDACTED        <=5 |   262,456 
        40 |  REDACTED        <=5 |   181,648 
        50 |   131,670         11 |   131,681 
        60 |    73,046         14 |    73,060 
        70 |    43,131         74 |    43,205 
-----------+----------------------+----------
     Total |  REDACTED   REDACTED |   971,912 


. 
. log close
      name:  <unnamed>
       log:  E:\analyses\opensafely-risk-factors-research-full\analysis\output/1daysooner.log
  log type:  text
 closed on:  19 Sep 2020, 10:05:28
-----------------------------------------------------------------------------------------------------------------------------------------------------------------
